backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 180
      - 240
      - 3
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple
      - 1
      - 1
      dtype: float32
      filters: 3
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: &id003 !!python/tuple
      - 3
      - 3
      name: conv2d
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
  - class_name: BatchNormalization
    config:
      axis: !!python/object/apply:tensorflow.python.training.tracking.data_structures.ListWrapper
      - - 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config:
          dtype: float32
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config:
          dtype: float32
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config:
          dtype: float32
      moving_variance_initializer:
        class_name: Ones
        config:
          dtype: float32
      name: batch_normalization
      scale: true
      trainable: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d
      padding: valid
      pool_size: &id002 !!python/tuple
      - 2
      - 2
      strides: *id002
      trainable: true
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 9
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_1
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_1
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 18
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_2
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_2
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      dtype: float32
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      kernel_size: *id003
      name: conv2d_3
      padding: valid
      strides: *id001
      trainable: true
      use_bias: true
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      dtype: float32
      name: max_pooling2d_3
      padding: valid
      pool_size: *id002
      strides: *id002
      trainable: true
  - class_name: Flatten
    config:
      data_format: channels_last
      dtype: float32
      name: flatten
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 80
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          dtype: float32
          mode: fan_in
          scale: 2.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 15
      use_bias: true
  - class_name: Dropout
    config:
      dtype: float32
      name: dropout_1
      noise_shape: null
      rate: 0.5
      seed: null
      trainable: true
  - class_name: Dense
    config:
      activation: softmax
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config:
          dtype: float32
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          dtype: float32
          seed: null
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 3
      use_bias: true
  name: sequential
keras_version: 2.2.4-tf
